index=cloudtraillogs_aws_audit meta_account_no=7045454537057 source="90177"
| search "fnd_fct_stg_review"
| spath
| eval principalId = coalesce('userIdentity.sessionContext.sessionIssuer.principalId','userIdentity.principalId')
| eval role_arn    = coalesce('userIdentity.sessionContext.sessionIssuer.arn','userIdentity.arn')
| rex field=role_arn "arn:aws:iam::\d+:role/(?<role_name>[^/]+)"
| stats count min(_time) as first_seen max(_time) as last_seen by principalId role_name role_arn eventName
| convert ctime(first_seen) ctime(last_seen)
| sort -count

index=cloudtraillogs_aws_audit meta_account_no=7045454537057 source="90177"
| search "fnd_fct_stg_review"
| spath
| eval principalId = coalesce('userIdentity.sessionContext.sessionIssuer.principalId','userIdentity.principalId')
| eval role_arn    = coalesce('userIdentity.sessionContext.sessionIssuer.arn','userIdentity.arn')
| rex field=role_arn "arn:aws:iam::\d+:role/(?<role_name>[^/]+)"
| stats values(role_arn) as role_arns values(role_name) as role_names values(principalId) as principal_ids

index=cloudtraillogs_aws_audit meta_account_no=7045454537057 source="90177"
| search "fnd_fct_stg_review"
| spath
| table _time eventName userIdentity.type userIdentity.principalId userIdentity.sessionContext.sessionIssuer.arn userIdentity.arn sourceIPAddress
| sort 0 -_time

index=cloudtraillogs_aws_audit meta_account_no=7045454537057 source="90177"
| search "fnd_fct_stg_review"
| spath
| search eventSource="glue.amazonaws.com"
| search eventName IN (
    GetTable, GetTableVersion, GetTableVersions,
    CreateTable, UpdateTable, DeleteTable,
    GetPartitions, CreatePartition, UpdatePartition, DeletePartition,
    BatchCreatePartition, BatchDeletePartition, BatchUpdatePartition
)
| eval table_name=coalesce('requestParameters.name','requestParameters.tableName',
                           'requestParameters.table.name','requestParameters.tableInput.name')
| where table_name="fnd_fct_stg_review"
| eval principalId_full='userIdentity.principalId'                                   /* e.g., AROA...:K053721@... */
| eval roleArn=coalesce('userIdentity.sessionContext.sessionIssuer.arn','userIdentity.arn')
| rex field=roleArn "arn:aws:iam::\d+:role/(?<role_name>[^/]+)"
| table _time eventName table_name principalId_full role_name roleArn sourceIPAddress
| sort 0 -_time

index=s3accesslogs_aws_audit "app-id-90177-dep-id-114232-uu-id-plx8m7sl1nf0"
| rex field=message "app-id-90177-dep-id-114232-uu-id-plx8m7sl1nf0/(?<object_key>[^\s]+)"
| rex field=message "arn:aws:sts::(?<account_id>\d+):assumed-role/(?<role_name>[^/]+)/(?<session_name>[^\s]+)"
| rex field=message "(?<operation>REST\.[A-Z\.]+)"
| rex field=message "(?<status_code>\d{3})"
| rex field=message "(?<ip_address>\d+\.\d+\.\d+\.\d+)"
| eval principalId_full=account_id . ":" . session_name
| table _time operation status_code object_key principalId_full role_name ip_address
| sort 0 -_time



