index=cloudtraillogs_aws_audit meta_account_no=975050130293
"arn:aws:sts::975050130293:assumed-role/app-cyberflow_hcd/iceberg-aws-b10a6d2a-4b1d-47ee-b6cd-0b67294d68eb"
| rex field=_raw "\"eventName\":\"(?<event_name>[^\"]+)\""
| rex field=_raw "\"eventSource\":\"(?<event_source>[^\"]+)\""
| rex field=_raw "\"awsRegion\":\"(?<aws_region>[^\"]+)\""
| rex field=_raw "\"errorCode\":\"(?<error_code>[^\"]+)\""
| rex field=_raw "\"errorMessage\":\"(?<error_message>[^\"]+)\""
| rex field=_raw "\"requestID\":\"(?<request_id>[^\"]+)\""
| rex field=_raw "\"sourceIPAddress\":\"(?<source_ip>[^\"]+)\""
| rex field=_raw "\"requestParameters\":\{\"bucketName\":\"(?<bucket>[^\"]+)\",\"key\":\"(?<object_key>[^\"]+)\""
| search (error_code="AccessDenied" OR error_message="explicit deny" OR error_message="not authorized" OR "403")
| eval service=split(event_source,".")[0]
| eval summary=service." → ".event_name
| table _time summary aws_region bucket object_key error_code error_message source_ip request_id
| sort -_time
